Инвентаризация_IT/src/Documents/ПередачаОтветственности/ПередачаОтветственности.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПередачаОтветственности</name>
  <tabularSections>
    <name>УвольняемыйСотрудник</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РабочиеМеста</name>
    <attributes>
      <name>РабочееМесто</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Ответственный</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НовыеОтветственные</name>
    <attributes>
      <name>РабочееМесто</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НовыйОтветственный</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Инвентаризация_IT/src/Documents/ПередачаОтветственности/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)

  Для Каждого СтрокаОтветственных Из НовыеОтветственные Цикл
    РабочееМесто = СтрокаОтветственных.РабочееМесто;
    НовыйОтветственный = СтрокаОтветственных.НовыйОтветственный;

    Если ЗначениеЗаполнено(РабочееМесто) И ЗначениеЗаполнено(НовыйОтветственный) Тогда
      
      ДокРабочееМесто = РабочееМесто.ПолучитьОбъект();
      ДокРабочееМесто.Ответственный = НовыйОтветственный;
      ДокРабочееМесто.Записать(РежимЗаписиДокумента.Проведение);
      
    КонецЕсли;
  КонецЦикла;
	Сообщить("Пупа");
КонецПроцедуры
